lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/mem_manager/fsl_component_mem_manager_light.c
        st = kStatus_MemSuccess;
    } while (false);
    ENABLE_GLOBAL_IRQ(regPrimask);
    return st;
}

static bool MEM_AreaIsEmpty(memAreaPrivDesc_t *p_area)
{
    bool res = false;

    blockHeader_t *FreeBlockHdr     = p_area->ctx.FreeBlockHdrList.head;
    blockHeader_t *NextFreeBlockHdr = FreeBlockHdr->next_free;
    if ((FreeBlockHdr == (blockHeader_t *)p_area->start_address.raw_address) && (NextFreeBlockHdr == NULL))
    {
        res = true;
    }

    return res;
}

mem_status_t MEM_UnRegisterExtendedArea(uint8_t area_id)
{
    mem_status_t st = kStatus_MemUnknownError;
    memAreaPrivDesc_t *prev_area;
    memAreaPrivDesc_t *p_area_to_remove = NULL;
    uint32_t regPrimask                 = DisableGlobalIRQ();

    do
    {
        /* Cannot unregister main heap */
        if (area_id == 0U)
        {
            st = kStatus_MemFreeError;
            break;
        }
        prev_area = MEM_GetAreaByAreaId(area_id - 1); /* Get previous area in list */
        if (prev_area == NULL)
        {
            st = kStatus_MemFreeError;
            break;
        }

        p_area_to_remove = (memAreaPrivDesc_t *)prev_area->next;
        if (p_area_to_remove == NULL)
        {
            st = kStatus_MemFreeError;
            break;
        }
        if (!MEM_AreaIsEmpty(p_area_to_remove))
        {
            st = kStatus_MemFreeError;
            break;
        }

        /* Only unchain if no remaining allocated buffers */
        prev_area->next        = p_area_to_remove->next;
        p_area_to_remove->next = NULL;

        st = kStatus_MemSuccess;
    } while (false);

    ENABLE_GLOBAL_IRQ(regPrimask);

    return st;
}

mem_status_t MEM_Init(void)
{
    mem_status_t st = kStatus_MemSuccess;
    uint8_t memHeap_id;
    if (initialized == false)
    {
        initialized = true;
        st          = MEM_RegisterExtendedArea(NULL, &memHeap_id, 0U); /* initialized default heap area */
    }
    return st;
}

static void *MEM_BufferAllocateFromArea(memAreaPrivDesc_t *p_area, uint8_t area_id, uint32_t numBytes)
{
    uint32_t regPrimask = DisableGlobalIRQ();

    blockHeader_t *FreeBlockHdr     = p_area->ctx.FreeBlockHdrList.head;
    blockHeader_t *NextFreeBlockHdr = FreeBlockHdr->next_free;
    blockHeader_t *PrevFreeBlockHdr = FreeBlockHdr->prev_free;
    blockHeader_t *BlockHdrFound    = NULL;

#if defined(cMemManagerLightReuseFreeBlocks) && (cMemManagerLightReuseFreeBlocks > 0)
    blockHeader_t *UsableBlockHdr = NULL;
#endif
    void *buffer = NULL;

#ifdef MEM_MANAGER_BENCH
    uint32_t START_TIME = 0U, STOP_TIME = 0U, ALLOC_TIME = 0U;
    START_TIME = TM_GetTimestamp();
#endif /* MEM_MANAGER_BENCH */

    do
    {
        assert(FreeBlockHdr->used == MEMMANAGER_BLOCK_FREE);
        if (FreeBlockHdr->next != NULL)
        {
            uint32_t available_size;
            available_size = (uint32_t)FreeBlockHdr->next - (uint32_t)FreeBlockHdr - BLOCK_HDR_SIZE;
            /* if a next block hdr exists, it means (by design) that a next free block exists too
               Because the last block header at the end of the heap will always be free
               So, the current block header can't be the tail, and the next free can't be NULL */
            assert(FreeBlockHdr < p_area->ctx.FreeBlockHdrList.tail);
            assert(FreeBlockHdr->next_free != NULL);

            if (available_size >= numBytes) /* enough space in this free buffer */
            {
#if defined(cMemManagerLightReuseFreeBlocks) && (cMemManagerLightReuseFreeBlocks > 0)
                /* this block could be used if the memory pool if full, so we memorize it */
                if (UsableBlockHdr == NULL)
                {
                    UsableBlockHdr = FreeBlockHdr;
                }
                /* To avoid waste of large blocks with small blocks, make sure the required size is big enough for the
                  available block otherwise, try an other block !
                  Do not check if available block size is 4 bytes, take the block anyway ! */
                if ((available_size <= 4u) ||
                    ((available_size - numBytes) < (available_size >> cMemManagerLightReuseFreeBlocks)))
#endif
                {
                    /* Found a matching free block */
                    FreeBlockHdr->used    = MEMMANAGER_BLOCK_USED;
                    FreeBlockHdr->area_id = area_id;
#if defined(MEM_STATISTICS_INTERNAL)
                    FreeBlockHdr->buff_size = (uint16_t)numBytes;
#endif
                    NextFreeBlockHdr = FreeBlockHdr->next_free;
                    PrevFreeBlockHdr = FreeBlockHdr->prev_free;

                    /* In the current state, the current block header can be anywhere
                       from list head to previous block of list tail */
                    if (p_area->ctx.FreeBlockHdrList.head == FreeBlockHdr)
                    {
                        p_area->ctx.FreeBlockHdrList.head = NextFreeBlockHdr;
                        NextFreeBlockHdr->prev_free       = NULL;
                    }
                    else
                    {
                        assert(p_area->ctx.FreeBlockHdrList.head->next_free <= FreeBlockHdr);

                        NextFreeBlockHdr->prev_free = PrevFreeBlockHdr;
                        PrevFreeBlockHdr->next_free = NextFreeBlockHdr;
                    }

                    BlockHdrFound = FreeBlockHdr;
                    break;
                }
            }
        }
        else
        {
            /* last block in the heap, check if available space to allocate the block */
            int32_t available_size;
            uint32_t total_size;
            uint32_t current_footprint = (uint32_t)FreeBlockHdr + BLOCK_HDR_SIZE - 1U;
            int32_t remaining_bytes;

            /* Current allocation should never be greater than heap end */
            available_size = p_area->end_address.raw_address - current_footprint;
            assert(available_size >= 0);

            assert(FreeBlockHdr == p_area->ctx.FreeBlockHdrList.tail);
            total_size      = (numBytes + BLOCK_HDR_SIZE);
            remaining_bytes = (available_size - total_size);
            if (remaining_bytes >= 0) /* need to keep the room for the next BlockHeader */
            {
                if (p_area->low_watermark > remaining_bytes)
                {
                    p_area->low_watermark = remaining_bytes;
                }
                /* Depending on the platform, some RAM banks could need some reinitialization after a low power
                 * period, such as ECC RAM banks */
                MEM_ReinitRamBank((uint32_t)FreeBlockHdr + BLOCK_HDR_SIZE,
                                  ROUNDUP_WORD(((uint32_t)FreeBlockHdr + total_size)));

                FreeBlockHdr->used    = MEMMANAGER_BLOCK_USED;
                FreeBlockHdr->area_id = area_id;
#if defined(MEM_STATISTICS_INTERNAL)
                FreeBlockHdr->buff_size = (uint16_t)numBytes;
#endif
                FreeBlockHdr->next      = (blockHeader_t *)ROUNDUP_WORD(((uint32_t)FreeBlockHdr + total_size));
                FreeBlockHdr->next_free = FreeBlockHdr->next;

                PrevFreeBlockHdr = FreeBlockHdr->prev_free;

                NextFreeBlockHdr       = FreeBlockHdr->next_free;
                NextFreeBlockHdr->used = MEMMANAGER_BLOCK_FREE;
#if defined(MEM_STATISTICS_INTERNAL)
                NextFreeBlockHdr->buff_size = 0U;
#endif
                NextFreeBlockHdr->next      = NULL;
                NextFreeBlockHdr->next_free = NULL;
                NextFreeBlockHdr->prev_free = PrevFreeBlockHdr;

                if (p_area->ctx.FreeBlockHdrList.head == FreeBlockHdr)
                {
                    assert(p_area->ctx.FreeBlockHdrList.head == p_area->ctx.FreeBlockHdrList.tail);
                    assert(PrevFreeBlockHdr == NULL);
                    /* last free block in heap was the only free block available
                       so now the first free block in the heap is the next one */
                    p_area->ctx.FreeBlockHdrList.head = FreeBlockHdr->next_free;
                }
                else
                {
                    /* update previous free block header to point its next
                       to the new free block */
                    PrevFreeBlockHdr->next_free = NextFreeBlockHdr;
                }

